app/views/recipes/_recipe.html.erb

SELECT COUNT(*) FROM "steps" WHERE "steps"."recipe_id" = 1
---
					Steps:
					<%= recipe.steps.count %>