app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "ingredients"
---
	def index
		@ingredients = Ingredient.paginate(page: params[:page])

INSERT INTO "ingredients" ("name", "substitution") VALUES (?, ?)  [["name", "milk"], ["substitution", ""]]
---
	def create
		@ingredient = Ingredient.new(params[:ingredient])
		if @ingredient.save

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT 1  [["id", "1"]]
---
	def show
		@ingredient = Ingredient.find(params[:id])