app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "recipes"
---
	def index
		@recipes = Recipe.paginate(page: params[:page])

INSERT INTO "recipes" ("created_at", "source", "title", "updated_at", "uploaded_user") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 07 Dec 2012 16:05:55 UTC +00:00], ["source", ""], ["title", "Interesting"], ["updated_at", Fri, 07 Dec 2012 16:05:55 UTC +00:00], ["uploaded_user", 1]]
INSERT INTO "steps" ("instructions", "number", "recipe_id") VALUES (?, ?, ?)  [["instructions", "STEP 1"], ["number", 1], ["recipe_id", 2]]
---
	def create
		@recipe = Recipe.new(params[:recipe])
		step_num = 1
		@recipe.steps.each do |step|
			step.number = step_num
			step_num = step_num + 1
			step.recipe_id = @recipe
		end
		@recipe.uploaded_user = current_user
		if @recipe.save

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "9"]]
---
	def show
		@recipe = Recipe.find(params[:id])