app/controllers/users_controller.rb

INSERT INTO "users" ("admin", "created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@user = User.new(params[:user])
  	if @user.save

UPDATE "users" SET "name" = 'New Name', "email" = 'new@example.com', "password_digest" = '$2a$04$D7DWWt3YJudk0QpFMaMZJ.s9X00J8wqN6hjoeEdXCJMWRXMVyOmUa', "remember_token" = 'smrnmAOhGDMsqrJrzhZ0Kg', "updated_at" = '2012-11-26 16:55:49.032329' WHERE "users"."id" = 1
---
  def update
    if @user.update_attributes(params[:user])